# To generate this file, use `brew bundle dump`
# Alternatively, use `brew bundle dump --file=-` to print to stdout
# To install these formulae, run `brew bundle`

# Modern command replacement
brew 'fd'      # find
brew 'lsd'     # ls
brew 'bat'     # cat
brew 'lsd'     # ls
brew 'ripgrep' # grep
brew 'sd'      # sed
brew 'dust'    # du
brew 'dog'     # dig
brew 'assh'    # ssh

# Other essentials
# pstree

brew 'tree'  
brew 'git'  
brew 'git-delta'
brew 'jq'
brew 'gh'
brew 'oh-my-posh'
brew 'fzf'
brew 'vim'
brew 'helix'
brew 'watch'
brew 'wget'

brew 'jdxcode/tap/rtx'

cask "1password-cli"

tap  "homebrew/cask-fonts"
cask "font-hack-nerd-font"

# TODO: convert to install command(s)

# Cleaned output of `brew list --full-name -1`
# List with libraries removed:
# brew list --full-name -1 | grep -v "^lib"


# Data manipulation
# jless
# miller
# xsv

# Others
# ansible
# desk
# dive
# ffmpeg
# fx
# gh
# go
# gping
# hexyl
# htop
# hyperfine
# kubernetes-cli
# mosh
# navi
# node
# openldap
# rich-cli
# ruby
# websocat
# xz
# font-hack-nerd-font
# wireshark
# eddieantonio/eddieantonio/imgcat
# saulpw/vd/visidata
# font-hack-nerd-font